{
    'title': ['VYING FOR UNESCO RECOGNITION', 'City government taps police to also chase after illegal settlers', 'CEPMO refurbishes Dibshi jen Dibsho book sheds in parks', 'P15-M road reopens in Lamut', 'City to demolish illegal edifices in Busol, Buyog', 'Alliance essential to media survival', 'University of Baguio', 'Biz taxes hike plan still under appraisal', '338,300 kids to get measles, polio jabs', 'Public told to enjoy summer with caution', 'CAR now malaria-free as Apayao records zero cases', '14TH BENDIYAN FESTIVAL', 'NCIP’S OUTREACH PROGRAM', 'Task force turns over 3 village health stations', 'Inventions from Cordillera featured in exhibit of DOST', 'Study confirms SMS effective medium for infant vax reminders', 'Special day set to honor health workers of Baguio', 'Mayor Romeo Salda', 'AMDC', 'Baguio Center Mall', 'Seedlings given to 20 families in Bontoc', 'Baguio Water District', '50 teams signify to join  inaugural CGFI Golf Cup', 'BENECO', 'Itogon student and team clinch 2023 PHL Open Int’l Darts title', 'Bruno’s Restaurant', 'Sangiao leads victorious fighters in 2 ONE events', 'CAR’s economy valued at P337.7 billion in 2022', 'CAAA Supermart', 'BJMP officer easily completes Mt Pulag to John Hay 100K run', 'DA-BFAR', '“LUGI NEGOSYO”', 'Son of Olympian to join PHL team in 32nd SEAG', 'SSS runs after evaders in nationwide campaign', 'Dep-Ed', 'BSU tops CARASUC 2023 Meet in Kalinga', 'Collective thoughts', 'JOB OPPORTUNITIES', 'DA-PhilRice provides 10T bags of inbred seeds to Abra', 'Issue on higher fuel costs in Baguio City reopened', 'SM Baguio among hosts of nationwide job fair, May 1 ', 'Agri- tourism fair set this May', 'DPWH', 'JHMC', 'Philex Mining Corporation', 'Amazing Japan (part 2)', 'A visit from a Rotary International representative', 'Survey says Benguet solon is top lawmaker in Cordillera', 'THANK YOU, CHIEF PNP', 'DepEd-Mountain Province reports learners’ progress', 'Two farmers caught selling P6.7 M worth MJ in Baguio', 'DONATION FOR FIRE VICTIMS', 'DILG reminds LGUs to extend benefits for senior citizens', 'One-stop shop for tourists in Lagayan, Abra opens', 'Aid for Bontoc reaches P9 M', 'April 30, 2023'],
    'date': ['APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 30, 2023', 'APRIL 29, 2023'],
    'content': ['VYING FOR UNESCO RECOGNITION — The stone-walled Maligcong Rice Terraces in Bontoc, Mountain Province has been nominated for the UNESCO-Greece Melina Mercouri International Prize for the Safeguarding and Management of Cultural Landscapes. The Cultural Properties Protection and Regulation Division of the National Commission for Culture and the Arts has nominated the rice terraces for the award that was established in 1995 to reward outstanding examples of action to safeguard and enhance the world’s cultural landscapes. The award also aims to enhance the link between culture and development, through capacity-building and sharing of knowledge. — Harley Palangchao   ', '  In Baguio City, policemen do not just go around catching your ordinary criminals.  They also roam forests to chase after squatters. Mayor Benjamin Magalong earlier deputized members of the Baguio City Police Office as environment officers to strengthen the enforcement of the city’s environmental and sanitation laws. BCPO Director Col. Francisco Bulwayan Jr. welcomed the tasks. He said it is also a regular program of their department in keeping with the “makakalikasan” core value of the Philippine National Police. Hence, their regular patrol activities now include scouring safeguarded lots including forest reservations and watersheds for illegal settlers. This is part of the city’s intensified campaign against squatting and violators of the National Building Code and environmental laws. BCPO teams from the various stations also go around the different barangays on the lookout for uncollected garbage, cluttered sidewalks, and smelly creeks and waterways. All incidents are being reported to the mayor in group chats where member agencies and offices can immediately see and facilitate action on said concerns. The mayor said the city is taking seriously the drive for a cleaner, greener and environmentally sustainable Baguio City. – Aileen P. Refuerzo  ', '  Although two years have passed since the City Environment and Parks Management Office launched project Dibshi Jen Dibsho, nine refurbished book sheds still beckon and offer precious minutes, hours or maybe days of reading pleasure. As long as the utility cabinets over the benches hold books or reading materials, anyone could reach up and get one and lose oneself in the pages’ prints, colors or photos. Or promenaders may simply sit at the shed, rest and simply watch the world go by. Conversations between friends or strangers may also flourish in those benches. Strategically located in Malcolm Square, Upper Session Road, Botanical Park (3) and Burnham Lake (4), the sheds contain diverse materials which are donations from book-reading advocates, residents, and non-residents. For specialized and other materials, however, the public is invited to the Baguio City Public Library at Burnham Park.  To keep the project going, book donations are accepted at the Cepmo at City Hall, with Administrative Officer Sandra Almag as point person. Dibshi jen Dibsho, in Ibaloy language means “free book/s,” was conceptualized by Cepmo head Rhenan Diwas who has always advocated the widening of one’s horizons and life’s perspectives through reading. The sheds have been marked, “Take a book, read a book, share a book.” An apt reminder is this quote: “There is only one thing that could replace a book: the next book.” – Julie G. Fianza  ', '  LAMUT, Ifugao – Residents of Barangay Hapid in this town and its adjacent barangays now benefit from the improved Lamut-Hapid Road funded through the Conditional Matching Grant to Provinces (CMGP) program of the government. The P15-million worth road was inaugurated and turned over to the community recently by Department of the Interior and Local Government-Cordillera Assistant Director Ruperto Maribbay, Governor Jerry Dalipog, and Lamut Mayor Victomar Bunnol. The 850 meters long, two-lane road project connects Hapid to Barangay Tupaya in Lagawe and other areas. Around 700 households of said barangays will benefit from the CMGP project. “Malaki ang impact ng kalsada na ito sa amin lalo na at napagitnaan ng cornfield kaya mas madali na ang biyahe ng produkto namin na galing sa ibang barangay dahil hindi lang kami ang beneficiary ng kalsada na ito kundi pati barangays ng Lagawe at ibang lugar,” Hapid Punong Barangay Oliver Trinidad said. Tupaya Punong Barangay Joey Anghad said the newly-opened Hapid-Lamut Road is a big help for businesses in their community especially when it comes to transporting their products to the market and other areas. “Some buyers are now able to access our products directly through the improved road,” he said.  Dalipog said the road is the gateway to the road project connecting the municipalities of Lamut, Lagawe, Aguinaldo, Alfonso Lista, and Mayoyao to boost the economic and tourism activities. – Marcelo Lihgawon  ', '  The heightened patrolling of Busol and Buyog watersheds, two of the few remaining pine stands and sources of potable water in Baguio City, led to the discovery of 10 ongoing illegal constructions in the past three weeks and these are now the subject of demolition proceedings.\nMayor Benjamin Magalong has directed the Anti-Squatting and Anti-Illegal Structure Committee (ASAISC) to expedite the demolition process based on the established procedures for constructions that are built or being built on safeguarded lands like watersheds and forest reservations.\nThe committee said demolition orders are being prepared to remove the structures.\nEngr. Angel Nerveza of the City Buildings and Architecture Office Investigations Division said eight structures were discovered at the Busol watershed by patrol teams of the Baguio City Police Office Station 6 under Maj. Rommel Quinio.\nTwo illegal structures were chanced upon last April 16 while patrolling the center of the watershed, another illegal settlement was spotted at the Ambiong side of the watershed on April 17, and still another improvement was reported also on April 17.\nNerveza said four more structures were discovered later at the watershed owned by just two persons. These will also be issued demolition orders.\nThese were all immediately issued first and final notice of violation with a directive to voluntarily demolish within 72 hours. Hearings were conducted with the owners, the City Environment and Parks Management Office, and the barangay concerned.\nThe Baguio City side of Busol straddles Ambiong and Pacdal barangays.\nIn Buyog, which spans Pinget and West Quirino Hill barangays, two large constructions were also discovered and owners were issued first and final notice of violation last April 19.\nMagalong earlier ordered the police to conduct regular patrol over Busol and Buyog watersheds as a deterrent against squatting which continues to threaten what was left of the forest reservations.\nThis is part of the city’s intensified campaign against illegal constructions, both ongoing and existing all over the city.\nThe CBAO said ongoing constructions found in safeguarded areas are immediately endorsed for demolition while those found in private lots are issued cease and desist orders with the owners directed to first secure building permits and other requirements. – Aileen P. Refuerzo  ', '  With the changing landscape of communication now in the digital world, the only way for the traditional mass media to retain its authority as the source of factual information is to collaborate with each other.\nMongolian journalist Duuya Baatar, a McCain Global Leader for 2022 and keynote speaker during the 27th National Press Forum in Manila, said via Zoom it is important for the newsrooms, whether in broadcast and in print, to hold the line together to protect the integrity of the media.\nBaatar acknowledged the declining trust of the community towards traditional media as primary sources of news due to the rise of citizen journalism in social media, the latter undermining journalism principles in news gathering and presentation of news.\nShe said it is high time for the media to collaborate with one another to create a stronger bond to fight disinformation especially in the various social media platforms. \n“When we only compete among ourselves, people cannot see broadcast or print, but they see media as media. Our readers are most often disillusioned that social media is run by professional journalists,” Baatar said.   \nShe said it’s time for the media to recognize that about 80 percent of the market is captured by various entities in social media while traditional media is left with only 20 percent as its audience.\nBaatar said if traditional media would collaborate in fighting disinformation, a bigger percentage of people would be recovered from these questionable sources of information.\nShe said the media needs to call out people and educate them about the difference between a journalist and a non-journalist.\nThis was echoed by Rappler’s Inday Espina-Varona, saying the media should start building trust among each other.\n“Let us go beyond our instinctive competitive urges and acknowledge that this is not just a race of our ratings, but appreciation of good stories that help the public know. How should we expect the community to trust us if we ourselves cannot trust others?” Varona said.\nShe said in rebuilding the trust among media, it could mean being not afraid to cite each other when presenting stories, especially those news outlets who labored to get the stories first.    \nAlso, in correcting each other’s mistakes, she said instead of ranting about it on social media, it is better for a colleague to go straight to the person or news organization involved for correction or a friendly reminder.\nWhen it comes to challenging social media as a platform for news, especially those coming from social media accounts that are not journalists by profession, Varona said journalists could go deeper into their presentation of stories rather than creating simple news reports.\n“Right now is the perfect chance for us to go back to traditional journalism methods, to go deeper in the subject matter, go to the human factor,” she said.\nShe said this could also be a means to combat the rise of artificial intelligence (AI) that is challenging newsrooms around the world.\nPhilippine Press Institute Chairman-President Rolando Estabillo said PPI has started pushing its member newspapers to go for digitalization in order to cope with the changes in the digital age.\nThe PPI News Commons (ppinewscommons.net) is an online news-sharing community which connects the 70-member local media outfits in Luzon, Visayas and Mindanao of the organization.\nThe platform, launched in 2022, aims to collate and curate local news from across the country and serve as a springboard to a wider audience and help secure the future of journalists.\nEstabillo said the monetization of the platform is currently ongoing to assist PPI’s member newspapers in going digital.\nThe 27th National Press Forum has the theme, “Midya at Pandemya: Reporting in the new normal. Taking charge of journalism post-pandemic” where other panelists discussed on the need for the media to take advantage of going digital and learn the ropes such as monetization of its contents.\nOne of the Cordillera’s community papers, Baguio Chronicle, won the Best Edited Community Newspaper, Best Editorial Page, and Best in Reporting on Migration Issues during the awards night held on April 25. – Ofelia C. Empian  ', '   ', '  The city council has referred back to the executive department the latter’s proposal to raise business taxes and other fees for possible reconsideration.\nThe proposal, presented by City Treasurer Alex Cabarrubias during the council session on April 24, seeks to raise business taxes by 40 percent.\nCabarrubias said the increase was computed in consideration of the fact the city government did not update the Tax Ordinance for 22 years.\nThe Local Government Code (LGC) allows the city to increase business taxes every five years as long as it does not exceed 10 percent of the rates fixed by the LGC.\nMembers of the city council referred back the proposal for reconsideration to include, among other things, the possibility of adjusting the increase to 20 percent, instead of 40 percent.\nCouncilors Peter Fianza and Betty Lourdes Tabanda said the proposed increase, although it may have a legal basis, is oppressive.\n“Imposing a 40 percent increase might not be in the interest of justice. It violates the basic law in taxation that taxes must not be oppressive,” they said.\nCouncilor Jose Molintas said instead of imposing a one-time increase of 40 percent to cover for the years the city government did not adjust the rates, the executive department should consider a 20 percent increase then raise it to 10 percent after five years. \nThe proposed increase in the proposal depends on the kind of business and their gross receipts.\nFor instance, for manufacturers, the proposal projects a 40 percent increase in the fixed rates plus 0.56 percent on the excess of the gross receipt bracket.\nAs a result, a manufacturer that has a gross receipt of below P10,000 will be charged P358 yearly compared with the P248 imposed by the Tax Code.\nThe baseline of the figures presented by Cabarrubias was in 2019, before the pandemic hit.\nFor manufacturers with a gross receipt of P762,747,000, the tax collected was P1.9 million and with the proposal, the tax will become P4.3M.\nFor wholesalers, the proposal is 40 percent on the fixed rates plus 0.75 on the excess of the brackets.\nAs a result, wholesalers with a gross of P8,000 will pay P395. The tax collected was P281 using the current Tax Code.\nFor those with a gross of P42.6M, the tax to be collected is P333,000 compared with the P117,000 collected under the Tax Code.\nFor retailers, Cabarrubias said the proposed adjustment offers an option that retailers with gross receipts of more than P50,000 but not more than P400,000 will be levied a three percent tax and those with gross receipts of more than P400,000 will be imposed one percent.\nThe other option is to impose a fixed tax to brackets starting from gross receipts of over P50,000 but less than P75,000 and 0.50 percent to capture the excess amount.\nAs a result, if the retailers’ gross receipt is P50,301, they will pay P1,509 if three percent tax is levied. But if the other option is followed, the tax to be imposed is P2,044.\nIn the current ordinance, the tax paid by retailers that have a gross receipt of P50,301 was P1,408.\nFor retailers with a gross receipt of P10,812,000, the tax will be P116,128 with the three percent tax imposition. But if the other option is applied, the tax will be P84,564.\nUnder the current ordinance, the tax imposed on retailers with such gross receipt was P44,126.\nThe proposed tax adjustment for other lines of business have varying rates.\nCabarrubias said the projected collection from the tax adjustments if implemented will be P332,225,789, assuming the city hits the 2019 levels of gross receipts from the more than 18,000 businesses operating then.\nThe proposal also eyes to increase other fees, such as the mayor’s fee to be raised from P200 to P1,500 to P3,000 and the processing fee from P450 to P1,500, among the other adjustments.\nIt also proposes to impose a non-refundable fee of P50,000 from those seeking exemption from the Zoning Ordinance.\nCouncilor Benny Bomogao said this proposal needs to be reconsidered as it is a form of denying a person the right to seek exemption.\nCabarrubias said the fee is a deterrent to those who keep on seeking an exemption form the Zoning Ordinance.\nTabanda said those seeking for exemption will be minimized if the Comprehensive Land Use Plan will be out so that people will know the classification of their area before they build their structure.\nThe council asked the executive department to refine the proposal and incorporate the inputs of the members. They also asked that the City Legal Office be involved in fine-tuning the proposal.\nMayor Benjamin Magalong earlier asked the council to give preferential consideration to the proposed adjustment to the Tax Code.\nThe council earlier asked the CTO to present the basis, adjustments, and the projected increase in collection before the council could act on it and subject the same to a public consultation. – Jane B. Cadalig  ', '  The Department of Health-Cordillera will launch a mass vaccination of children against polio and measles-rubella in May to arrest the projected outbreak of the diseases this year.\nThe immunization targets children zero to 59 months old, regardless of their vaccination status.\nDOH-Cordillera Nurse V Joyce Rillorta said the vaccination is a response to the recommendation of the World Health Organization in September 2022 for the Philippines to conduct supplemental immunization, after a projection the country is at risk of an outbreak in polio and measles this year.\nFor the measles-rubella, the DOH-Cordillera is aiming to immunize 155,991 children who are nine to 59 months old and 182,376 children zero to 59 months old to be given the bivalent oral polio vaccine (BOVP).\nIn Abra, the DOH targets to reach 20,010 children for measles-rubella vaccination and 23,221 for the BOVP.\nThe DOH aims to immunize 11,751 children in Apayao for measles rubella and 13,618 for BOPV while 38,278 children in Benguet are targeted for measles-rubella and 45,087 for BOPV.\nIn Baguio City, 29,269 children are targeted for measles-rubella and 34,894 for BOPV while 20,551 kids in Ifugao are targeted for measles-rubella and 23,917 for BOPV.\nIn Kalinga, the DOH is targeting 21,240 children for measles-rubella and 24,778 kids for BOPV while11,751 kids are aimed to be vaccinated against measles-rubella and 16,861 kids are targeted for BOPV vaccination in Mountain Province.\nThe DOH wants a 95 percent vaccination coverage rate for eligible kids during the vaccination drive that will last for the whole month.\nRillorta said the projected outbreak in polio and measles this year is traced to the low immunization of kids against the diseases in 2019, which was aggravated when the regular immunization of kids was interrupted by the pandemic that hit in 2020.\nIn 2021, three in four kids were not vaccinated against measles, according to Rillorta.\n“If outbreaks happen, kids will suffer from the diseases that are preventable in the first place. It will also be a challenge for local government units, which will need additional funds and will disrupt their focus on other diseases,” she said.\n“There is no medicine for polio, rubella, and measles other than vaccination. We want to interrupt the transmission of the viruses that cause these diseases and prevent additional outbreak in the health care system.”\nRillorta said the DOH-Cordillera will implement a combination of house-to-house, fixed post, and temporary post approach to reach as many eligible children as possible.\n���We aim to achieve an 85 percent coverage rate in two weeks, 90 percent by week three, and 95 percent by week four,” she said.\nThe DOH has engaged the support of line government agencies like the Department of the Interior and Local Government, Department of Social Welfare and Development, the Civil Service Commission, the Office of the Civil Defense, the Philippine Information Agency, Rotary Club, and social media influencers. – Jane B. Cadalig  ', '  Enjoy summer, but cautiously.\nThe Department of Health-Cordillera said the diseases that occur during the dry months are not only triggered by the rise in temperature and global warming, but also by the activities people do to deal with the heat.\nThis is why the DOH is advising the public to still observe the minimum public health standards (MPHS) to lessen risk of getting sick with summer diseases and to be spared from the Covid-19 that remains a health concern.\nDOH-Cordillera Medical Officer IV Jennifer Pira said family trips to the beach or to resorts will expose people to the crowd and water where infections spread easily.\n“During these months, expect conjunctivitis and flu-like infections because of gatherings where diseases can easily spread,” she said.\n“Diving in the water can cause ear and eye infections, drinking water from unsure sources, and eating food that are exposed or spoiled causes diarrhea. This is why people should be cautious while enjoying summer,” Pira said.\nShe added observance of the MPHS that became the normal practice since the pandemic should remain even if the government eased the Covid-19-related restrictions.\nData from the DOH-Cordillera showed summer diseases and other infections have increased from January to April 15 this year.\nThe agency recorded 387 cases of acute bloody diarrhea in the region, or an increase of 121 percent from the 175 cases recorded in the same period last year.\nThere are four cholera cases this year. No cases were recorded in the same period last year.\nThe region also had 18 cases of measles-rubella, which is an increase of 125 percent from the eight cases recorded in the same period last year.\nCases of typhoid and paratyphoid fever reached 841 last year,or an increase of 58 percent from the 531 cases recorded in the same period last year.\nDengue, which used to be considered a rainy-day disease, reached 903 cases, which is a four percent increase than the 865 cases last year.\nThe DOH recorded 663 cases of hand, foot, and mouth diseases from January to April 15.\nThere are 1,460 influenza-like illnesses recorded all over the region, which is a 26 percent increase than the 1,150 cases recorded in the same period last year.\nDOH Senior Health Program Officer Jethro Simeon III said the cases listed in the region are a combination of suspect and confirmed cases.\nHe added the public should still be wary of the Covid-19, which remains a health concern.\n“The minimum public health standards should still be observed. Do not be lax. Wear masks in crowded places and avail of vaccination. Also, let us follow the recommendation of health experts for our safety,” he said. – Jane B. Cadalig  ', 'MALARIA-FREE REGION — All provinces in the Cordillera are now malaria-free, according to the Department of Health after DOH OIC Maria Rosario Singh-Vergeire led the declaration of malaria-free status to Apayo province with DOH-CAR Director Rio L. Magpantay and Apayao Provincial Health Officer Mark Joleen Calban leading a delegation from the region in receiving the award last week. Other provinces have previously achieved similar status after recording zero malaria case in the past five years. — Roy Fiaching via DOH-CAR Facebook photo  All the provinces in the Cordillera region are now malaria-free with the Department of Health recently certifying Apayao as officially free of malaria.   DOH Officer-in-Charge Maria Rosario Singh-Vergeire and other health officials led the recognition of program implementers from the different local government units that were declared as malaria-free from 2019 to 2022. Apayao was among the 16 provinces recognized during the World Malaria Day and Malaria-Free Awarding ceremony in Quezon City on April 25. The award was received by DOH-CAR Director Rio Magpantay, DOH-CAR Vector Borne Control Program Coordinator Roy Fiatching, Apayao Provincial Health Officer Mark Calban, and Apayao Governor’s Office Chief of Staff Verlie Baldovino.   Apayao achieved the mark of being malaria-free for posting zero local transmission of the disease in the past five years. Calban shared the strategies of the province in achieving the zero-free malaria status, which include communication for behavioral impact, vector control, and educating the community. He also emphasized the sustainability measures the province implemented that greatly contributed to sustaining the good record. Calban said these measures are the establishment of malaria diagnostic centers, conduct of case finding activities, and entomological surveillance, and strengthened surveillance system. In her keynote message, Vergeire said the DOH will continue the fight against malaria in the country aiming to make the country malaria-free by 2030. Vergeire said the country has made significant leaps in its malaria response in the past 30 years. From 95,778 confirmed cases and 864 deaths in 1992, the figures were reduced to more than 48,000 cases and 162 deaths in 2003. She added efforts to control malaria through continuous research to deliver a new and evidence-based intervention should be sustained even if 66 provinces have been declared malaria-free and 15 provinces have already reached elimination status. Vergeire recommended that program management be expanded through continuing research in order to give fresh and evidence-based treatment. She also promoted innovations in diagnosis, treatment and vector control. – Redjie Melvic Cawis  ', '14TH BENDIYAN FESTIVAL — Clad in their traditional ethnic regalia called “divit” for women and “kubal” for men, residents of Kabayan, Benguet celebrated the 14th Eco-Tourism and Bendiyan Festival on April 27 with the sought-after “bendiyan” which usually gathers a large number of performers to showcase their rich culture and tradition. The other events such as the “abang” and “owik” were well-attended by officials and villagers from the town’s 13 barangays. — Dave Leprozo, Jr.   ', 'NCIP’S OUTREACH PROGRAM — Health personnel of the National Commission on Indigenous Peoples-Abra, in coordination with the Rural Health Unit of Bucay conducted an outreach mission for indigent indigenous peoples from cultural communities in the municipality. — NCIP photo   ', '  Three barangays in Pilar, Abra now have Barangay Health Stations (BHS) funded under the Support to Barangay Development Program (SBDP) of the National Task Force to End Local Communist Armed Conflict (NTF-Elcac). Department of the Interior and Local Government Cordillera Director Araceli San Jose said the inauguration and turnover of the BHS worth a total of P11.7 million in barangays Gapang, Nagcanasan, and Ocup signifies the government’s success in achieving peace and security in Pilar. She said the BHS will provide the initial professional medical care to patients through a proactive approach employing preventive interventions, chronic illness management, and promotion of self-care. Pilar Mayor Tyron Christopher Beroña said the BHS will definitely be of great assistance to his constituents. “These health stations are an essential component of establishing a healthy community that will provide high quality primary health care services to our most vulnerable individuals, families, and communities, including immunizations, prenatal care, monitoring of morbidity, and referral services,” he said. Norlita Domen, a resident of Barangay Gapang, described her experiences prior to the availability of a BHS in an interview. She said those who wanted to seek medical consultation had to travel five sitios. “It was extremely tough for us to go that far at our age. But now that health stations have been established in these three barangays, the availability of health services can be guaranteed,’ she said. Reynalda Tulza, a resident of Barangay Nagcanasan, also said it was really a trying time before construction of the BHS. “We had to walk all the way to Poblacion, but since our conditions have gotten better, we no longer have to. This has brought about a great deal of change, especially considering the government’s funding of a large number of such projects. We are really grateful that the national government is working hard to reach vulnerable barangays,” Tulza said. SBDP is a hallmark program of the NTF-Elcac with the goal of bringing development to former conflict-prone communities. It is part of the government’s whole-of-nation approach in fighting armed rebellion in the countryside. – Pamela Geminiano  ', '  The Department of Science and Technology-Cordillera in partnership with the city government and other concerned agencies and organizations launched the first CordiNNOVATION Exhibit on April 25 and 26 at Malcolm Square. The two-day event featured 15 exhibitors from academic institutions, government agencies, and entrepreneurs in the Cordillera. With the approval of the Innovation Act back in 2019, the Regional Research Development and Innovation Committee celebrated the first CordiNNOVATION exhibit as part of a series of activities lined up for Innovation Month and other events for the year. Mayor Benjamin Magalong, in a message read by executive assistant Samantha Hamada, highlighted the importance of innovation to further the city’s progress. “We need to inspire and empower our innovators and entrepreneurs to develop ground-breaking solutions that will create inclusive and sustainable communities. We must foster collaboration among different stakeholders to create an ecosystem that supports innovation,” the mayor said. Hamada also shared the mayor’s vision of transforming Baguio City into a digital and innovation hub that enables its citizens, regardless of their backgrounds or status, to participate in the innovation economy. DOST-CAR Director Nancy A. Bantog said the exhibit aims to commercialize the products, services, and processes displayed during the event. “It’s really important to use innovations if we are to improve the way we are doing things. Productivity, efficiency, effectivity, ‘yon ang mga gagampanan ng innovations na dapat natin i-adopt sa ating community,” she said. Some of the technologies featured in the exhibit are the Technical Education and Skills Development Authority’s 3D printer and CNC machine that allow users to create innovative products such as their 7-in-1 tool, 32-in-1 multi-hammer; Saint Louis University’s solar coffee dryer; and consortium for agriculture, aquatic and resources, research and development’s miniature of aeroponics system. Bantog said the DOST-CAR and its partners will continue to extend their help to the micro, small, and medium enterprises even after the event. “Marami tayong programs na tutulong sa mga MSMEs. So approach any of these institutions who are here and after this exhibit, you can always go to our office,” she added. Interested innovators may visit the DOST-CAR office at Km. 6 Halsema Highway, La Trinidad, Benguet or contact its office at (074) 422-2214. – Camille Galvan  ', '  A study revealed that automated short message service (SMS) reminders to parents of infants needing vaccines worked well especially during the Covid-19 lockdown and quarantine periods. “Though more suited for urban areas, with proper implementation and continued evaluation, SMS reminders have the capacity to improve the National Immunization Program,” the vaccination study abstract stated. The study entitled “Immunize Baguio” was done at the Baguio General Hospital and Medical Center by Dr. Karla Rigos as supervised by Dr. Elaine Corpuz, head of Pediatrics at BGHMC. Now assigned at the Benguet General Hospital, Rigos hopes to duplicate the same study for statistical and geographic condition confirmation. Vaccines for pneumonia, polio, diptheria, tetanus and hepa-B for 530 infants zero to three or four months old were the subjects of the study.  The electronic program and application was developed by the BGHMC Information Technology personnel and fully funded by the Department of Health. Infant vaccinations were not done as timely due to intermittent travel restrictions and quarantine/lockdowns, but were completed, the study shows. Parents or guardians complied with SMS reminders sent to them three times; at six, 10, and 14 weeks. However, the decreased number of vaccination or what is considered vaccination dropout is discernible. The study recommended the expansion of Immunize Baguio in all health centers within Baguio and neighboring provinces. Rigos said 10 of the 16 city health districts were study sites, namely Atok Trail, Engineers Hill, Campo Filipino, Asin, Loakan, Lucban, Scout Barrio, Quirino Hill, Mines View and Pacdal health centers. Materials were provided and health care workers were trained on the procedures. The study stated partnership between the DOH and the local government unit allows the expansion of telecommunication coverage and digital instruments in health centers as auxiliary to standard practice. The program is also recommended for modification into the current electronic medical record and health information system of DOH, the rural health units, health centers, and barangay health stations. Corpuz reminded the public that vaccines are one of the most important preventive measures for infectious but vaccine-preventable diseases. The protection for the vaccine works even after vaccination, thus works as herd immunity and for community protection as well, she added. Parents are reminded vaccines will be available to their children at the health centers to boost immunity against measles, rubella, and polio. Health districts’ health care workers may be contacted for any information, Corpuz said. – Julie G. Fianza  ', '  Officials declared May 7 every year as Health Workers Day in Baguio pursuant to Republic Act 10069 and other related laws, rules, and regulations. In a resolution, the council said considering the significance of the role of the health workers in the private and public sectors, the local government is inclined to declare May 7 as Health Workers Day as an appreciation for the hard work and passion of the city’s health workers. RA 10069, which declared May 7 of every year as Health Workers Day was passed to recognize the important role and contribution of workers who provide vital health services to the public and promote their rights and welfare and enhance their sense of worth and dignity. As defined in the law, health workers are persons who are actively engaged in health and health-related work regardless of employment status, including medical, allied health professionals, administrative and support services personnel, and those employed in hospitals, sanitaria, health infirmaries, health centers, rural health units, barangay health stations, and clinics and other health related establishments owned and operated by the government or its political subdivisions with original charters or by the private sector. The coalition or alliance of health workers in the city will conduct a Health Workers Day fair on May 7 at the People’s Park where booths will be setup for services that will be available for health workers and the public.  – PIO release  ', '   ', '   ', '   ', '  Seedlings given to 20 families in Bontoc BONTOC, Mountain Province – Backyard-grown vegetables will soon be added as food on the table of 20 families that received eggplant and pechay seedlings from the Office of the Municipal Agriculturist (OMAG) on April 26. Assistant Municipal Agriculturist Catherine Agcon said 179 eggplant seedlings and 40 packets of pechay seeds were given to the parents of 20 malnourished children. It was sourced from the Agricultural Program Fund. This health and nutrition intervention of the local government aims to promote backyard gardening which is cost-efficient and healthy. Tilapia starter and grower feeds and crates were also turned over to fisherfolk of the different barangays of Bontoc. Administrative Officer IV Ross Kiat-ong of the OMAG said 35 sacks of feeds and 50 crates sourced from the Gender and Development Program fund were distributed to the fisherfolk who have previously received tilapia fingerlings from the Bureau of Fisheries Aquatic Resources on March 1. – Christy Mae F. Che-es and Flora Mae A. Apos  ', '   ', 'TWO WEEKS TO D-DAY — The inaugural Cordillera Golfers Foundation Inc. Cup set at Camp John Hay and Pinewoods Golf & Country Club has attracted more than 50 teams that signified their intention to join the event for-a-cause that aims to raise funds for the civic projects and programs of the charity group. — Harley Palangchao   Around 50 teams have signified their intent to participate in the inaugural Cordillera Golfers Foundation, Inc. Cup set at Camp John Hay and Pinewoods Golf & Country Club on May 18 to 20. Organizers of the event for-a-cause, which aims to raise funds for civic projects and programs of CGFI, announced more than P2.1 million worth of giveaways will be distributed to registered participants, who will see action in the regular and seniors divisions. CGFI President Arnel Peil reported the teams that signified to participate composed of players from various parts of the country, including players from the Cordillera. “It’s all systems go and we are overwhelmed by the support of the different teams and players who believe in our cause,” said Peil, who, together with the members of the different committees, has been busy preparing for the tournament. The deadline for the registration is on May 1 with a team fee of P50,000. Each team will be composed of four players, whose scores will all be counted during the tournament. Aside from the giveaways, dinners and raffle prizes, the registration fee entitles each player to a one-day practice round and a two-day tournament proper in both courses. The tournament will adopt the PAL scoring system similar to the Fil-Am Invitational Golf Tournament. The organizing committees will soon announce the prizes for players who will score a hole-in-one, an albatross, or an eagle in designated holes at CJH and PGCC. CGFI also partnered with FilGolf, which will regularly update the scores of every participant through its official portal, filgolf.com. Among the initial civic projects of the CGFI is to donate financial assistance to schools in depressed areas in all provinces and cities in the Cordillera in a bid to motivate the learners in their areas. CGFI, a non-stock, non-profit group duly registered with the Securities and Exchange Commission, also plans to conduct outreach missions in depressed areas in coordination with concerned government agencies and private partners. – Harley F. Palangchao  ', '   ', 'BENGUET’S PRIDE — Jolandy Bag-oyen of Team Goldi of Itogon, Benguet (3rd from left) teamed up with Mindanao’s Bong Gabiana and Wency Cortes, both of GMD, to win the top prize in the draw triples category of the 2023 Philippine Open International Darts Tournament in Tacloban City on April 12 to 16. — NDFP photo   Darters from Benguet won during the 2023 Philippine Open International Darts Tournament in Tacloban City on April 12 to 16. Leading the Cordilleran darters was Team Goldi Itogon member Jolandy Bag-oyen, who partnered with Bong Gabiana and Wency Cortes from Mindanao to form Team GMD and won first place in the draw triples category. Bag-oyen, a grade 12 student of Alejo M. Pacalso Memorial National High School, and his team won a P180,000 cash prize for the feat. He previously topped the youth singles event during the National Darts Tournament in Santiago City, Isabela during the Balamban Dance Festival 2022. Other Itogon darters from Barangay Tuding were Owen Palomo who placed fourth, while Patrick Basile placed eighth in the same category. Sangguniang Kabataan Federation President Councilor Aljay Cuyahon gave assistance to the Itogon team, whose members were first-timers in the international darts tournament. Meanwhile, Giselle Bulahao of Yagyagan, Tuba, Benguet placed second in the ladies category during the event also joined by other darters from the province. In February this year, Bulahao has emerged as champion in the ladies’ singles category of the National Darts Tournament at the Provincial Capitol, Ipil, Zamboanga Sibungay. She beat National Darts Federation of the Philippines female top seed Ging Ansale of Team Pacman/GMD with 4-0 score during the seven series championship game.  Bulahao of Team R@x Brotherhood Benguet led other 18 lady darters during the event organized by the NDFP where she received a trophy and P16,000 cash prize. She also teamed up with Eduardo Largo and Ceasar Pausal from Mindanao to become the champion in the classified draw triplets category besting other 261 players. – Ofelia C. Empian  ', '   ', 'VICTORIOUS FIGHTERS — Jhanlo Mark Sangiao and Carlos Alvarez (inset) of Team Lakay were victorious in their respective bouts at the legendary Lumpinee Boxing Stadium in Bangkok, Thailand on weekend. The other victor was Denice Zamboanga. — ONE photos   Three Filipino mixed martial arts fighters led by Jhanlo Mark Sangiao earned impressive victories in two fight events of ONE Championship at the legendary Lumpinee Boxing Stadium in Bangkok, Thailand on weekend. The 20-year-old Sangiao just needed 58 seconds to stop the 38-year-old Matias Farinelli of Argentina via kneebar in the first round of their catchweight bout in the undercard of ONE Fight Night 9. Sangiao first went for a possible stand-up fight with Farinelli with a flying kick before he managed to bring the game to the mat. Moments later, the rising phenom from the famed Team Lakay executed a kneebar submission for his third straight win in the promotion. With his impressive win, Sangiao received another $50,000 performance bonus from ONE top honcho Chatri Sit-yodtong, his second bonus in less than a year. Fellow Filipino female fighter Denice Zamboanga also displayed her mastery of the stand-up trade against Julie Mezabarba of Brazil for a hard-earned unanimous decision victory. The 26-year-old Zamboanga, who is currently ranked third in the atomweight division, has landed overhand rights to overwhelm her opponent in the stand-up exchange. Zamboanga has also executed excellent takedown defense that somewhat frustrated the Brazilian from putting the fight on her favor. The Filipino fighter improved her MMA record to 10 wins and two losses while the Brazilian suffered her third consecutive losses. Earlier, Team Lakay’s Carlos Alvarez had his biggest win yet when he demolished Reza Abasi enroute to a second-round technical knockout win in his promotional debut. The 24-year-old Alvarez displayed an improving ground game and grappling among Team Lakay fighters with his excellent takedowns and vicious ground-and-pound. Referee Herb Dean came to Abasi’s rescue when he had seen enough following unanswered barrage of hammer fists from the Baguio City native fighter. Alvarez, who is the brother-in-law of former ONE flyweight world champion Geje Eustaquio, improved his record to two wins and zero loss. Meanwhile, ONE Warriors Series Philippines winner Adonis Sevilleno, who joined Team Lakay, was overpowered by Road to ONE: Mongalia winner Enkh Orgil, who won via unanimous decision in the catchweight contest. While Sevilleno displayed excellent takedown defense all throughout the three five-minute rounds, the Mongolian has convinced the judges he was the more dominant and aggressive fighter. – Harley F. Palangchao  ', '  The Cordillera’s economy grew by 8.7 percent in 2022, the second highest growth among the 17 regions in the country. The region’s economy last year, valued at P337.7 billion, surpassed the pre-pandemic level, which was P321.7B in 2019. Philippine Statistics Authority-Cordillera Director Villafe Alibuyog said the region’s Gross Regional Domestic Product (GRDP) level in 2020 stepped back by four years and it took two years for the region to get back on track and exceed the 2019 value of the economy. Cordillera’s economy backtracked in 2020 with a value of P288.9B due to the pandemic. It grew in 2021 at P310.8B. Of the region’s three major industries, Alibuyog said that services contributed the most to Cordillera’s economic growth last year with 7.1 percent followed by the industry that contributed 1.8 percent. Agriculture, forestry, and fishing slowed down the region’s economic growth as it posted a -0.2 percent growth. Of the Cordillera’s P337.7B economic value, services contributed almost half, or P225.6B, while the industry sector accounted for P83.9B. Agriculture, forestry, and fishing contributed P28.1B. The major contributor to the services sector’s P225.6B share to the regional economy is wholesale and retail trade, repair of motor vehicles and motorcycles, which was valued at P60.6B or 26.7 percent, while the share of financial and insurance activities is 17.7 percent; real estate ownership and dwelling, 10.4 percent; professional and business services, 8.6 percent; and education, 8.4 percent. On the industry sector, manufacturing had the biggest share valued at P43.1B or 51.4 percent followed by construction with 30.4 percent; mining, 11.3 percent; and electricity, steam, water, and waste management; 6.9 percent. On agriculture, forestry, and fishing sector, crops contributed the biggest share valued at P18.5B or 65.9 percent, while animals contributed a 22 percent share. Support activities to the sector contributed 9.9 percent while aquaculture contributed 0.9 percent. The economy of all the regions in the country expanded in 2022 and nine regions recorded a growth that was faster than the 7.6 percent average national growth. Cordillera is second to Western Visayas that recorded the fastest growth at 8.7 percent. Western Visayas’ economy grew by 9.3 percent in 2022. National Economic Development Authority Policy Formulation and Planning Division Chief Freda Toyoken said the full reopening of the economy, coupled with implementation of policies that safeguard public health, contributed to the region’s economic growth. Another factor that helped in the recovery of the region’s economy is the high vaccination rate, which was at 97 percent in December 2022. She said the high vaccination rate improved the confidence of people to engage in various economic activities. Toyoken said another factor that helped accelerate Cordillera’s economy was the regional allocation of P135.5 million that was translated to public goods and services that provided the necessary support for the production in agriculture, industry, and services sectors. – Jane B. Cadalig  ', '   ', 'LIKE A WALK IN THE PARK — Jail S/Insp. Rhys Yvan Dane Pawid of La Trinidad, Benguet has completed the 100-kilometer ultra-trail run from the foot of Mount Pulag in Babadak, Kabayan, Benguet to Camp John Hay in Baguio City in 18 hours, 35 minutes, and 57 seconds to claim the overall title in the King of the Mountain Marathon Pulag 100 edition on April 22 to 23. — Jonel Mendoza   Rising ultra runner Rhys Yvan Dane Pawid has emerged the overall champion in the inaugural King of the Mountain Marathon (KOTM) Pulag 100 edition on April 22 to 23. Pawid, who is a senior inspector in the Bureau of Jail Management and Penology, clocked in at 18 hours, 35 minutes, and 57 seconds where he led the group of ultra-runners from the starting point at the Pulag Ranger Station at Sitio Babadak in Barangay Bashoy, Kabayan, Benguet towards the finish line at Camp John Hay in Baguio City. In about two hours, Romando Cumahling tailed him with a time of 20:17:29 while Elmer Retolado came in close at third place with a time of 20:39:57.  Itogonia Mountain Marathon race director Don Antonio Santillan finished in fourth at 22:50:25 while Thang Hoang Huu came in fifth at 23:44:55. Runners went through an approximately 120 kilometers race course, with a mix of dirt paths, single track trails and concrete roads.  The event also has many demanding ascents and breathtaking descents. The total elevation gain was around 6,430 meters while total elevation loss is approximately 7,410 meters. Marjorie Velo led the female runners, finishing the race at 26:31:45 and placed 13th overall. Maria Cecilia Kiswa placed second at 28:28:16 while Jessica Amos and Isabel Milagros Quipse crossed the finish line at 28:52:16 for third place.  There were 88 finishers from 113 participants, or a success rate of 78 percent. The 2023 Pulag 100 is also a qualifying race for the 2024 Western States Endurance Race in the United States for all those who finish the race. – Ofelia C. Empian  ', '   ', '“LUGI NEGOSYO” — Tomatoes are left unharvested in Bila, Bokod, Benguet and neighboring towns such as in Tinoc, Ifugao when the price of tomatoes dropped to P3 a kilo. Affected farmers said a wholesale price of P50 a kilo would be sufficient to cover for their expenses. — Dave Leprozo, Jr.   ', 'SEAG-BOUND — Eduard Josh Buenavista of Baguio will compete in the 5,000 meters long distance run and 3,000 meters steeple chase in the 32nd edition of the Southeast Asian Games in Cambodia next month. He is the son of two-time Olympian Eduard Buenavista. — UP Track and Field Team graphic   Anytime soon, Baguio City will have a future Olympian who is currently following the footsteps of his father, who also happens to be a two-time Olympian himself. The University of the Philippines Track and Field Team announced last week that Eduard Josh Buenavista is one of the athletes from UP that will see action in the 32nd Southeast Asian Games set next month in Cambodia. The 22-year-old Buenavista will compete in the 5,000-meter long distance run and 3,000-meter steeplechase. The UP team also announced that Buenavista will be joined by Edwin Giron who will compete in the 800-m. and 1,500-m. while Alhryan Labita will compete in the 400-m. hurdles. The fourth UP athlete to see action in the 5,000-m. and 3,000-m. steeplechase is Abegail Manzano. This will be the first time that Buenavista will compete in the SEA Games as a senior level athlete. He once represented the Philippines as a youth/junior level competitor. This early, his fellow athletes are confident that Buenavista will be a podium finisher. In December last year, Buenavista broke two long-standing records in the University Athletic Association of the Philippines (UAAP) Season 85 Collegiate Athletics Championship. He first broke the 10,000-m. run in 32:08.30 minutes, smashing the 32:38.88 minutes set by Nelbert Ducusin of Far Eastern University in UAAP Season 68. Reports said the 10,000-m. is not the territory of Buenavista, but UP Coach Rio dela Cruz entered the former in the event hoping he could contribute points for the Maroon squad.  Buenavista also broke the 5,000-m. UAAP record when he clocked 15:16.37 for his second gold. Buenavista, who is taking up Bachelor of Sports Science at UP Diliman, is the son of two-time Olympian and holder of the Philippine record for multiple long-distance events Eduardo “Vertek” Buenavista, who hails from South Cotabato but moved his family to Baguio City. – Harley F. Palangchao  ', '  The Social Security System conducted simultaneous Run After Contribution Evaders (RACE) operations in 108 areas around the country to call on non-compliant employers to settle their contribution delinquencies. SSS President and Chief Executive Officer Rolando Macasaet said the synchronous RACE activities across the country affirm SSS’ commitment in ensuring the social security protection of its 31.96 million employee-members. Macasaet said SSS will be issuing notices to employers around the country who neglect their obligations of paying their employer and employees’ share in the contributions. After receiving the show-cause orders, SSS will give delinquent employers 15 days to coordinate with their servicing SSS branch office and settle their contribution delinquencies. Macasaet reminded employers that Republic Act 11199 or the Social Security Act of 2018 requires them to report for coverage to the SSS all their employees and/or kasambahays within 30 days from their actual employment date and remit the corresponding monthly contributions of their workers. On the other hand, household employers shall shoulder the SS contributions of kasambahays who are earning P5,000 or less. In the SS Act, employers who fail to register their employees or have not deducted and remitted their contributions will be penalized with a fine of P5,000 to P20,000 and face imprisonment ranging from six years and one day to 12 years. “We appeal to all employers to be considerate to their employees by reporting them to SSS and regularly remitting their monthly contributions so they can be protected by receiving social security benefits in times of various contingencies,” Macasaet said. He urged them to settle their delinquencies by availing of the contribution penalty condonation programs offered by SSS that will allow them to pay the unremitted contributions less the accrued penalties. Delinquent business employers can apply for the Contribution Penalty Condonation and Delinquency Management and Restructuring Program while household employers can avail of the Contribution Penalty Condonation and Restructuring Program. SSS conducted the first RACE operations in 2017 when it visited delinquent employers in Greenhills, San Juan, and Cubao, Quezon City. The following year, SSS brought the RACE campaign to the regional level. – Press release  ', '   ', '   Benguet State University has emerged as the overall champion in this year’s Cordillera Administrative Region Association of State Universities and Colleges (Carasuc) 2023 Athletic Meet held at the Kalinga State University, Bulanao, Tabuk City on April 18 to 22.   BSU bagged 127 gold, 73 silver, and 32 bronze medals during the sports category of the event while it also dominated the socio-cultural competition with 149 points. BSU ruled in the group games baseball, basketball women (5 vs 5) and basketball women (3 vs 3), badminton men, football, futsal, volleyball men, beach volleyball men, sepak takraw men and women. BSU also topped the lawn tennis women, chess men and in men and women athletics. In dancesports, the partnership of Mico Dumalos and Mary Luz It-itan emerged as champion in the Latin category while Mark Benter and Jhosan Galvez bagged the silver medal in the same category, while Jayson Ace Abenoja and Maezelle Tadeo ruled the standard category. Also, BSU bets Kristian Salio and Xyliene Obiacoro showed their skills and beauty and secured the crown as Mister and Miss Carasuc 2023. Salio also won the darling of the crowd special award, which is part of the socio-cultural event. Kalinga State University placed second with 41 gold medals courtesy of its strong showing in arnis and first championship title in softball and in 3 vs 3 basketball. Mountain Province State Polytechnic College placed third with 32 gold, followed by Ifugao State University with 25 gold, Abra State Institute of Science and Technology (ASIST) with 15 gold, and Apayao State College with 10 gold medals. In the socio-cultural competition, following BSU was KSU with 135 points, ASIST in third place with 99, IFSU in fourth with 73, ASC in fifth with 67 and MPSPC in sixth place with 58 points. The winners in each event will represent the region for the Philippine ASUC 2023. – Ofelia C. Empian  ', '  (Editors’ note: The Midland Courier is reprinting the columns of the late Atty. Benedicto T. Carantes as a tribute to one of its long-time columnists. This piece was published on April 26, 2009.) We did our own personal survey, using a sampling of 100 respondents that included relatives, friends, and colleagues, if only to find out what was brewing on their minds, given the current situation of the country today, and here are some of their concerns. Question: From the following list, who do you trust? Politicians Lawyers Media Police Seventy percent said they don’t trust any from the list, and 30 percent refused to give any answer. * * * * * *  * * * * We then altered our questions a bit, and posed the following query to the unresponsive 30 percent. Of the four in the list, who do you trust the least? Five percent picked the politicians, another five percent agreed that lawyers are the least trusted, and still another five percent replied that media is untrustworthy. Fifteen percent or about half, said the police are not to be trusted, and even added the police are feared as much as criminals, if not more so. An illustration they cited is the presence of policemen in a restaurant, making not only the owner of the establishment uneasy, but also all the other customers. Strange, don’t you think? * * * * * *  * * * * It, however, occurred to me that since time immemorial, politicians have never been trusted anyway, but voters have the luxury of replacing them every election year, only to realize that only the faces of politicians change, but not their ways. Lawyers, meanwhile, started losing the trust of the public when their number increased multifold, and competition became cut throat, so to speak. Moreover, some Law schools were not teaching real Ethics to their students, but in fact, via Law professors who love to brag about themselves, gave the impression that money and fame are the true marks of a successful practitioner, which alas, cannot be achieved by being completely honest. * * * * * *  * * * * The jokes being circulated about lawyers and by the lawyers themselves were soon taken as realities. And owing to egocentricity, lawyers, unlike other professionals, are not a close-knit group, and except for drinking buddies, take pot shots at each other all the time. For example, a lawyer who lives in a big house and drives around in a flashy brand new car is deemed to have acquired these possessions dishonestly, either through some shady deal, or by selling his client down the river. Let me quickly add, however, that all these nasty talks about lawyers sometimes spring from envy, meaning hard luck, back-talking colleagues would do exactly the same thing, given the opportunity. Other lawyers go to court not to seek justice, equity, or redress, but to place themselves or their client in a bargaining position, hoping to force the hand of the litigant to settle for a tidy sum, since a lengthy trial would prove more costly than a quick pay off. * * * * * *  * * * * But everyone, including politicians and lawyers, and even the police, are scared of media. You see, if you get media’s goat, your public image will suffer for sure. Now unless you are murderous enough to shoot them in the head while riding a motorcycle, best to keep out of their hair. But unlike politicians who are practically all rotten eggs, there are bad eggs and good eggs in the legal profession and in media. Even media itself can readily identify who the bad eggs are. In the case of lawyers, all the rest are bad eggs except himself. Not surprisingly, media has retained a respectable status in society, which is probably why we have so many fake media personalities, particularly here in Baguio, since nearly everyone speaks and writes good English, and can pass themselves off as media, either as a tabloid reporter or what. At least, they are able to get away with it, unlike Manila media, who embarrassingly fracture the King’s grammar at every turn. * * * * * *  * * * * And what about the policemen? Right from the beginning, the rookie selection process is erratic. More often than not, it is the guys with criminal tendencies who apply to be policemen, and I wonder how they manage to escape the psychiatric examinations. Fit a Pinoy with a uniform and give him a gun, and you have a monster in your hands. I refuse to believe, however, that regional considerations have something to do with attitude, but the evidence seems to belie this position. Someone even said the New People’s Army rebels are better disciplined, considering they kill only those who owe blood debts, unlike the police who think that anyone who crosses them is the enemy – and should be erased from the face of the earth. Happily, Baguio policemen are not yet at that stage, I suppose until it is eventually recognized, God forbid. * * * * * *  * * * * I hate to gloat and say I told you so, but just before the onset of summer, the weather bureau predicted a long hot summer, and based on that prediction, I predicted a wet and rainy one. Like I always say, predictions by the weather bureau turn up wrong most of the time. Now they are again saying that summer will be rainy after all. Good. That means the sun will be coming back.  ', 'JOB OPPORTUNITIES — Labor Secretary Bienvenido Laguesma and SM Supermalls SVP for Operations Bien Mateo led the signing of the memorandum of agreement outlining their roles in the nationwide job fair held in Supermalls nationwide every May 1 of the year. Even after May 1, the partnership will continue to keep the malls open as an official venue for job fairs, which aim to provide employment opportunities for jobseekers as well as support the government’s efforts to reduce unemployment in the country. — SM handout photo   ', '  BANGUED, Abra – The Philippine Rice Research Institute of the Department of Agriculture awarded a total of 10,845 bags of certified inbred seeds to Abra farmers under the Rice Competitiveness Enhancement Fund (RCEF). The seed subsidy covers 5,361 hectares of rain-fed and irrigated rice lands across the province. The seeds are expected to increase harvests while lowering rice production costs. RCEF Seed Component Coordinator Dr. Andres dela Cruz Jr. and Governor Dominic Valera led the awarding during the RCEF social mobilization program at the Bangued covered court. Dela Cruz said all farmers in the province will benefit from the seeds provided they are registered under the Registration System for Basic Sectors in Agriculture (RSBSA). The RCEF prioritizes small rice farmers with land not exceeding two hectares to capacitate them on production, competitiveness, and profit.  “Lahat ng farmers ay makakauha ng binhi kung registered sila sa RSBSA. So hindi lang cash assistance ang makukuha ninyo sa RCEF kundi pati na rin mga certified inbred seeds na kakailanganin ninyo,” Dela Cruz said. Valera thanked the DA for its continuous assistance to the farmers not only in Abra but in the entire nation. “Ang tulong na ito ay isang simbolo na patuloy na pinapahalagahan ang mga magsasaka so we thank President Marcos who is the Secretary of Agriculture for his continuous assistance to us,” he said. – Christian Allister Tubadeza  ', '  The big difference between fuel prices in Baguio and other localities came into focus anew as Mayor Benjamin Magalong bemoaned the long standing issue he first addressed back in 2019. The mayor said a cursory look at the prevailing fuel costs in Baguio, La Union, and Quezon City showed a glaring disparity between the prices. For instance, the cost of Petron XCS, a high-quality premium motor gasoline, is lower by P10.50 in a station in La Union and by almost P15 in a station in Quezon City. “It is concerning. What gives?” he lamented. Magalong will write to the industry leader and the Energy Regulatory Board to again escalate the concern. It will be recalled in October 2019, the mayor sought audience with the executives of the three big industry players and aired the city’s appeal to reduce permanently the price differences. Petron Corporation through Assistant Vice President for Corporate Affairs Charmaine Canillas granted the appeal and reduced the cost in the city by P3. “We hope that we can again be granted price reduction to help our city in its economic recovery efforts,” the mayor said. Rep. Mark Go earlier also made the same appeal.  – Aileen P. Refuerzo  ', '  SM Supermalls will hold a nationwide job fair from April 30 to May 1. The job fair aims to provide employment opportunities for job seekers and support the government’s efforts to reduce unemployment in the country. The job fair is open to all jobseekers, including fresh graduates, returning overseas workers, and those who have been displaced from their jobs due to the Covid-19 pandemic. With SM as one of its official partners, the DOLE has invited various companies to participate in the job fairs, offering a wide range of job opportunities in different industries such as retail, hospitality, business process outsourcing, and the like. During the job fairs, applicants can submit their résumés and undergo initial interviews with the participating companies. Some companies even conduct on-the-spot job offers. As the official venue of DOLE for job fairs nationwide, the job fair will take place on April 30 at SMX Convention Center in Manila. Participating malls on May 1 are SM City Baguio, SM City Grand Central, SM Southmall, SM City BF Paranaque, SM City Sucat, SM City Marilao, SM City Pampanga, SM City Olongapo Central, SM City Tuguegarao, SM City Cabanatuan, SM CDO Downtown Premier, SM City Davao, and SM City San Jose del Monte. Since 2008, SM Supermalls has been holding job fairs across various SM malls in the Philippines. After May 1, the partnership will continue to keep the malls open as an official venue for job fairs all over the country. The job fair at SM Baguio will be at the atrium. For more information and updates, check www.smsupermalls.com or follow @SMSupermalls on social media. – Press release  ', '  For the whole month of May, the City Veterinary and Agriculture Office will conduct the 2023 Agri-Tourism Trade Fair at the Igorot Garden to link urban farmers and fisherfolk to markets and partnerships leading to sustainable livelihood promotions. CVAO head Dr. Silardo Bested said the event is pursuant to Ordinance 35, s. 2018, which institutionalized the Urban Farmers and Fisherfolk’s Month every May to focus on the invaluable contributions of farmers and fisherfolk in achieving food security and nation building. Eligible exhibitors of the activity include civil society organizations, accredited farmer cooperatives and associations, and individual famers and fisherfolk registered in the Registry System for Basic Sectors in Agriculture. Slated activities at the Igorot Garden are small animal and pet expo on May 1 to 7; food expo-cum-rabbit meat cooking contest, May 8 to 14; farmer’s processed products and fresh produce expo, May 15 to 24; and ornamental plants, seedlings and culinary herbs expo on May 25 to 31. – Gaby B. Keith  ', '    ', '   ', '   ', 'The 19.7-meter  RX-O Gundam full-scale Unicorn (robot)  at Odaiba lights and moves and takes about five minutes.  First stop in our amazing tour was the Todai-ji Temple, the largest wooden building in Japan which houses the largest bronze statue of Buddha measuring about 16.3 meters. We were keen on feeding the deers at the Nara Deer Park.\nWe eagerly bought our deer crackers as we prepared to feed some of the 1,000 Sika deers scattered and roaming the streets and the park. Crackers were priced at Y500.\nIn feeding the deers, you have to be careful as the deers could smell the crackers from a distance from your pockets and hands. They will try to nibble at your hands or nip your sides or buttocks. Aray! So, we ended up throwing all the crackers to them as they would walk with you until you give them the crackers. They are super friendly though. Park maintenance are quick to scoop tiny little remnants from the deers. It is said that if you bow ahead of the deer before feeding them, they will bow back.\nAt the Fushimi Inari Shrine, we experienced a walk through the famous orange tunnel featured in the “Memoirs of a Geisha” at Gion Shijo. Though we were not fortunate to meet a Geisha, we met a Maiko, an apprentice Geisha. Again, I could imagine “Sayuri” the adopted name of the grown up Chiyo putting on her white powder makeup. Risa Shinoda, explained the ceremony and mentioned that instances like this were beneficial. It was sad to hear that the Maikos and Geishas, just like the rest of the world, had no income during the pandemic because there were no tourists.\nGeisha and Maiko performances are quite expensive because they are special. We then walked to another temple filled with Sakura trees on the way and ended up in a bamboo forest. Our reward was a cone of Macha ice cream. It was like an ice cream macha festival. Almost everyone wanted a cone of Macha ice cream. It is however discouraged to eat while walking. But like all good tours, we had an unforgettable experience. Eight of us in the group got lost after dinner. Six were senior citizens and two were young ones. The group departed for the bus after dinner and failed to count the number of people following. A fork in the road was the culprit. It was a good thing young Reggie, who was trained in disaster management took the initiative to look for the bus in the multitude of people and voila found the bus parked near the temple. This is a lesson for all tour guides, to always count the members of your tour group before proceeding to the next destination. It is also imperative to leave your contact number or calling card with the group, or scribble the number of the hotel for everyone’s reference. The next day was a visit to the Kyoto Golden Pavilion or the Kinkakuji Temple passing thru Arashiyama, the Zen garden of Tenryyuji Temple, the Sagano bamboo forestand the Nishijin Textile Center for lessons in kimono weaving. Then, there were more temples to see and more walking.\nThe fourth day was a visit to one of the architectural wonders of Shiga Prefecture. This was the Miho Museum owned by the late Koyama Mihoko, who was one of the richest women in Japan. The museum was named after her. The structure was designed and built by Architect I.M. Pei, covering over 247 acres of property. Most of the structures were built underground. There is a section of the museum devoted to spirituality. One can get lost in this meditation room searching the galaxy of stars for meaning and purpose.\nNext stop was Hakone Castle. Then an exciting 15 minute ride via the Shinkansen bullet train running at a speed of 300miles/hour. The “Onsen” hot spring bath experience was something else. A traditional Japanese Kaiseki banquet dinner wearing a traditional yukata was awesome. According to our guide Janice and Wikipedia “the way to wear the kimono, a wrapped-front garment with square sleeves and a rectangular body is for the left side to wrap over right.” The 5th and 6th days were visits to Mt. Hakone, an active volcanic zone where there are encounters with active sulfurous fumes. The ride via the Hakone Ropeway or cable car gave us a good view of Mt. Fuji. Fortunately, it was not rainingbecause just like our Mt. Mayon, Mt. Fuji can also be elusive. Last stop was the famous Shibuya Crossing in Tokyo.\nThis crossing is named “the busiest pedestrian intersection in the world”. It is featured in countless films, magazines and blogs. An estimated 1,000 to 2,500 people cross theintersection every two minutes. And if you have watched Hachiko the movie, this is also where you can see the statue of “Hachiko” the loyal dog who waited for his owner for nine years to return. There were also visits to Asakusa Temple, where the largest paper lantern is found. There were small shops along the way and we found Ninja shoes or “farmer shoes” for Nashi and Deke.\nWe also found cute Japanese Tabi socks and Japanese bags usually carried with kimono outfits for Jackie, Anna and Eli.\nOf course, if the papa has ninja shoes, my seven-year-old apo, Eli Dominic, should also have one. Next on the list to visit were Ueno Park, Tsokiji market, the Imperial Palace and the towering 333-meter Tokyo Tower. The tower, like the Eiffel tower in Paris, gives a commanding view of Tokyo and small shops on the floors. The Ikaji fish market was a discovery because it was here where we to taste the best “wagyu” meat. In fact, the man selling “wagyu” must have been so exposed to tourists that he even knew how to pose.\nReggie enjoyed the different kinds of mochi “Japanese rice cakes” with a variety of flavors.\nOur last few days were spent visiting the small authentic Japanese restaurants in Tokyo, the Don Quijote store (Japan’s large-scale discount store chain.), the Odaiba (Japan’s artificial island) where you can see the RX-O Gundam full-scale Unicorn (robot) at DiverCity towering at 19.7 meters, tulips, the Skyway, etc.\nWe went to Odaiba via the glass-topped Water Bus, which circled the Tokyo waterways. We disembarked at the entrance of Skyway passing thru the replica of the statue of Liberty and hundreds of Sakura trees. We had good timing because we witnessed the five-minute lighting of the massive Gundam robot structure towering at 19.7 meters. In the Diver City Gundam Buiding is where you will find the collection of robots dating as far back as 1979 to the present. This is also where you buy the best selections of “do-it-yourself” robotics. If you have kids, they will enjoy a visit to this place. It is exciting even for senior citizens.\nWhile the rest of the group went back to the United States via the Narita Airport, three of us headed back to the Philippines via the Haneda Airport. There are still so many unexplored destinations in beautiful and amazing Japan.\nMy son, Deke, and his wife, Anna, experts in exploring Japan’s “off the beaten track” destinations had tried so many adventures. Our deep gratitude to Charmane “Shane” Muto, friend of Maika Rica Galulo and my daughter Reggie, for the assistance given to us and for letting us experience what the locals do. Shane is a Filipino Japanese who works and stays in Tokyo. She brought us to special places in Tokyo which were not part of the packaged tour and of course we enjoyed the discount store Don Quixote.\nShe also introduced us to the Pasmo Card, “a rechargeable contactless smart card, electronic money system, used for public transport in Tokyo. This system started on March 18, 2007. Pasmo can also be used as a payment card for vending machines and stores.”\nAt the end of the day, our unexpended balances in our Pasmo cards were used to buy items at their 7-11 stores. Japan is truly and amazing and beautiful country.\nI will end this article by singing with David Fenton, “I’m turning Japanese, I think I’m turning Japanese, I really think so”.  ', 'Presidents and representatives of the 11 Rotary Clubs of Cluster 1C award the token to RIPR Mary Berge through Assistant Governor and District Governor Nominee Designate Danilo Torres.  A first for the Rotary Clubs of Baguio City was the visit of the Rotary International representative of President Jennifer Jones, Mary Berge, and spouse Ivar on April 25. The rare occasion was made possible by past district governor (PDG) Rolando Villanueva who was a contemporary in international trainings of the PDG Mary of the United States. Eleven clubs of the cluster gathered to give the guests a taste of the hospitality of Baguio City and the cultural diversity of melded nationalities and ethnolinguistic groups.\nThe Philippine National Police officers and trainees gave a view of the music and dance of the Cordillera. The lively dance using gongs gave the visitors an idea of the indigenous customs and traditional wear hereabouts. Kariza Kris Chan, an international wushu champion, showed her winning form in a short performance of the Chinese sport. The unique athletic discipline of the Asian martial arts using a sword was displayed. But the gems of the evening were the five young children aged four to five years old from the Imelda Village Child Development Center. A product of the community project of Rotary Club of Baguio amongday care centers in the city, the group won the art and dance performance contest that the club conducted in December. The young ladies used the Kalinga instruments as props and danced to the tune of “Siwsiwit”. Dressed in the colorful beaded wrap around skirts, typical beads, and sunflower anklets, they were able to copy the common dance steps of the Kalinga tribe. The symbolic Key to the City of Baguio was awarded to RIPR Mary and spouse Ivar as honored guests of the city. Charter President Virgilio Bautista was emissary of the City Mayor Benjamin Magalong. There were group photographs as mementos of the occasion. Each of the clubs had their opportunities to share their smiles with the American pair.\nThere was group dancing too that she was gamely joined before the night ended for her, as the fellowship among the Rotarians continued. This was the taste of the Cordillera kind of welcome apart from the three-day district conference they witnessed in Clark, Pampanga during the weekend.  ', '  Benguet Rep. Eric Yap has emerged the best performing lawmaker in the Cordillera, according to the recent survey by the non-government organization, RP-Mission and Development Foundation Inc. (RPMD). Yap has garnered an 84.2 percent rating on the survey dubbed “House of Representatives Public Satisfaction in CAR”, the highest rating among the seven lawmakers in the region. The non-commissioned performance evaluation survey aims to assess the job performance of district representatives in the Cordillera based on district representation, legislation, and constituent service. “We thank the RPMD for this. I was surprised to be honest but regardless of the results, tuluy-tuloy lang ang trabaho natin,” Yap said in a statement. Baguio City Rep. Mark Go placed second with an 82.8 percent job performance rating while Ifugao Rep. Solomon Chungalao scored 80.5 percent in third.  Those in fourth to seventh places, according to the RPMD survey are Reps. Maximo Dalog Jr. of Mountain Province with 72.6 percent, Allen Jesse Mangaoang of Kalinga with 63.2 percent, Ching Bernos of Abra with 62.8 percent, and Eleanor Bulut-Begtang of Apayao with 57.5 percent. The RPMD said the results highlight the need for an ongoing evaluation and improvement of public officials to ensure they fulfill their responsibilities and serve their constituents to the best of their ability. It said the survey was part of the national poll, “RPMD’s Boses ng Bayan” conducted on Feb. 25 to March 8, which surveyed per district in every region with a total of 10,000 registered voters as respondents. Yap said he continues with his direction in providing easier access by the community to social services and other development programs. RPMD’s sampling margin of error is one percent with a 95 percent confidence level. The samples were randomly chosen, and the number of respondents per district were distributed proportionally based on the official voting population data.    In January, Yap was also named among the top performing legislators after garnering high marks for approval and trust in another survey by RPMD, ranking seventh among 251 district representatives. Yap was the only one among the six lawmakers in the Cordillera who made it in the list during the survey conducted on November to December 2022. Based on the RPMD website, it states that the organization “helps leaders and organizations solve their most pressing problems” through the use of data analytics. The 11-year-old NGO also stated it has field research specialists all over the Philippines based in key cities in Metro Manila, Visayas and Mindanao. “We have our active field representatives to monitor and analyze the political trends as well as to check on constituents’ viewpoints among the current officers,” it stated. – Ofelia C. Empian  ', 'THANK YOU, CHIEF PNP — Erstwhile PNP Director General Rodolfo Azurin, Jr. has been honored by President Ferdinand Marcos, Jr. during the former’s retirement honors at Camp Crame, Quezon City on April 24. Azurin, who traces his roots to the Ilocos region but was raised in Benguet, served the country and the Filipino people for 34 years. — PNP photo   ', '  BONTOC, Mountain Province – The Department of Education-Mountain Province Schools Division reported a gain in the performance of learners for all levels (kindergarten, elementary, junior and senior high school) in the second quarter compared to the first quarter of school year 2022-2023. MPSDO Curriculum Implementation Division Chief Khad M. Layag made the report during the Local Chief Executives Convergence held at the Sabangan Multipurpose Hall on April 13. Layag said there is a decrease in the number of elementary level learners who did not meet expectations (DNME) in all the learning areas except for the “mother tongue” which obtained an increase of DNME. For this level, Mathematics recorded the highest percentage of decrease in DNME at 4.33 percent, followed by Araling Panlipunan (3.69 percent), English (3.31 percent), Mapeh (3.18 percent), Science and Filipino (2.68 percent), Edukasyong Pantahan at Pangkabuhayan (2.38 percent) and Edukayon Sa Pagpapakatao (1.94 percent). There was also a decrease in the number and percentage of learners not meeting the expectations in the quarterly exam, which implies that school interventions are taking effect. For junior high school, data showed there is also a decrease in the number and percentage of learners with DNME status in the different learning areas. In descending order, the subject that gained the most in decreasing its DNME is still Math (6.46 percent), followed by English (5.71 percent), Science (5.01 percent), Mapeh (4.35 percent), ESP (4.21 percent), Filipino (4.09 percent), Technology and Livelihood Education (1.8 percent) and Araling Panlipunan (0.87 percent). Senior high school students also showed improvement, as indicated in the decrease on DNME for TVL (13.71 percent), English (11.48 percent), Araling Panlipunan (8.17), Science (6.28 percent), Math (4.95 percent), Filipino (0.85 percent), Mapeh (0.82 percent), and ESP (0.5 percent). Education stakeholders aim to increase the learning percentage of the succeeding quarters of the school year through the launching of the “Salidumay” partnership program cum-local chief executives convergence to promote collaboration for resiliency in basic education. – Clienteast Van B. Totanes  ', '  Authorities arrested two farmers for selling P6.7 million worth of marijuana to undercover agents in a buy-bust operation in Camp 7, Baguio City on April 26. The suspects were identified as Christopher Arnold Fabian Atonen and Daryl Camot Collera, both 27-year-old farmers and listed as high-value target individuals. The suspects were arrested by joint operatives of the Philippine Drug Enforcement Agency Bulacan Provincial Office, PDEA-Cordillera, and Baguio City Police Office after they sold 57 pieces of marijuana stalks and fruiting tops in a tubular plastic form to a poseur buyer. The illegal drugs have a weight of 56 kilograms estimated to be worth P6.7M. The inventories of the pieces of evidence recovered were conducted on-site in the presence of the suspects and witnessed by Prosecutor Philip Cesar Castel and Camp 7 Kagawad Arvin Jay Baldo.  The suspects will face charges for violation of Republic Act 9165 or the Comprehensive Dangerous Drugs Act of 2002. Meanwhile, the continuous marijuana eradication of the Police Regional Office-Cordillera led to the discovery of P3.4M worth fully grown marijuana plants and dried stalks in various towns in Benguet. On April 26, the operations conducted in barangays Sagubo and Beleng in Kapangan and in Barangay Kayapa in Bakun, both in Benguet have led authorities to discover and burn a total of 3,300 pieces of fully-grown marijuana plants with a total worth of P660,000. On April 24, simultaneous marijuana eradication operations in Sablan, Bakun, and Kibungan resulted in the discovery of 21,000 grams of dried marijuana stalks and 1,000 pieces of fully-grown marijuana plants worth P2,750,000. All marijuana plants were uprooted and burned on-site while investigation is ongoing to identify the cultivators in these areas. – Ofelia C. Empian  ', 'DONATION FOR FIRE VICTIMS — The local government of Bontoc, Mountain Province reported the Dalog family has donated P1 million for the victims of April 11 fire in the capital town. Rep. Maximo Dalog, Jr. and members of his family turned over the donation to Mayor Jerome Tudlong at the municipal Capitol on April 26. The Dalog family also turned over 94 sacks of half-cavan rice plus 250 boxes bath soap from the Children International Philippines, Inc. coursed through the Maximo B. Dalog Foundation, Inc. — Bontoc PIO photo   ', '  The Department of the Interior and Local Government Cordillera reiterated its call to local government units to continue providing grants and privileges to senior citizens for their overall well-being and full participation in society. “Let us be the answer to the hopes of millions of senior citizens who have been clamoring for a more effective implementation of laws and programs addressing the needs of the elderly. These measures will motivate and encourage our senior citizens to contribute to nation-building while also improving their lives,” DILG Regional Director Araceli San Jose said. Republic Act 7432 or the Senior Citizens Act, amended by RA 9257 and 9994 or the Expanded Senior Citizens Act, mandates government to provide senior citizens with employment, education, health, public service, housing, public transport, and other assistance such as social pension and PhilHealth coverage. The law also states senior citizens should be accorded 20 percent discount or exemption from the value added tax for their needs such as medicines, payment for influenza and pneumococcal vaccines, doctors’ fees in hospitals and other medical facilities, and medical and dental services in accordance with Department of Health and PhilHealth regulations. Senior citizens are also granted 20 percent discount in public transportation, movie houses, concerts, funeral and burial services. Senior citizens are also accorded five percent discount in electric and water consumption as long as the bills are under their names, and as long as their consumptions do not exceed 100 kilowatt-hours and 30 cubic meters. Aside from discounts, San Jose said minimum wage-earning senior citizens are exempt from paying taxes as mandated by RA 9504 or The Minimum Wage, Personal Exemptions, Additional Exemptions, Optional Standard Deduction Act. Also in Memorandum Circular 2023-045, LGUs need not to require senior citizens to submit additional requirements in case they want to provide them with additional benefits. They only need to present any of these identification cards: senior citizen ID from the Office of Senior Citizens Affairs, passport, or other document showing that the concerned person is 60 years old or over. In addition to the barangay certificate, lease agreement, proof of billing, and valid government ID, LGUs are not required to request proof of residency from senior citizens. LGUs are also mandated to give senior citizens free health, dental, and laboratory services in public hospitals and comparable facilities, in accordance with DOH and PhilHealth laws, whenever the need arises. The government may also provide educational assistance for post-secondary, tertiary, post tertiary education, vocational or short courses to older adults who seek to continue their studies through scholarships, grants, subsidies, and other incentives. The incentives include aid in the purchase of books, educational supplies, and school clothes, provided that the students pass their courses and shall meet minimum admission requirements. LGUs are also encouraged to provide senior citizens with express lanes at private and public institutions, or give them priority if such lanes are unavailable. – Pamela T. Geminiano  ', '  LAGAYAN, Abra – The local government unit recently opened a tourism and exhibit facility to serve as a one-stop-shop for tourism-related activities in the municipality. The facility now displays products made by locals who are mostly unemployed and single parents. Lagayan Tourism Officer Michelle Bersamira said once fully operational, the facility will become a service center where tour packages will be offered to visitors. “Diyan mangyayari lahat ng tourism-related services such as the main registration process and briefing at dito na rin idi-display lahat ng products ng Lagayan which are mostly woven and handicraft items,” Bersamin said in an interview. With popular destinations in the municipality such as the Lusuac Spring Resort, Ar-arbis Falls and some recently discovered class 3 caves, the LGU envisions Lagayan to be the future tourism capital of Abra. Bersamira said at Lusuac Spring Resort alone, the LGU is earning P100,000 during the lenten season. Around 1,000 to 2,000 local and foreign tourists are visiting Lagayan monthly. – Christian Allister Tubadeza  ', '  BONTOC, Mountain Province – Cash and in-kind donations for residents affected by the fire in the wee hours of April 11 in Barangay Poblacion here continue to pour in coming from generous donors including those overseas. As of 5 p.m. April 27, the local government has received P9,068,324.75 total cash donations based on the records of the Municipal Treasurer’s Office. Among the long list of donors are three children who showed that age is just a number when it comes to helping others. First is Hazel Cassandra “Gagsi” Lingbanan, from Barangay Samoki, Bontoc who happily opened her piggy bank on her seventh birthday and donated her savings totaling P3,155 to the fire victims. According to her mother Henrietta Claire, who works at the Municipal Disaster Risk Reduction and Management Office, Gagsi’s savings came from her “earnings” doing household chores and coins she set aside from her allowance in school. Her mother, who was deeply touched by the kind gesture of her daughter, accompanied her to the Bontoc Emergency Operations Center (EOC) where Gagsi handed her donation to MDDRM Officer Johanna Padaen.  Second is eight-year-old Johanna Carina Dominique “Ayachi” Pablo Kiat-ong, who studies at the Rainbow of Angels. She also emptied her piggybank containing P5,000 to help in the relief efforts. Her mother, who was amazed at the selfless act of her daughter, took a video of Ayachi while emptying her piggy bank.  Third is eight-year-old Castiel Jay “CJ” Bacwaden, a grade 2 pupil who also opened his piggy bank and donated P1,252.05. CJ started his piggy bank in April 2022. Their home is near the incident site where he saw the destruction caused by the fire. He and his cousin Kalel went to the EOC to hand over his savings. Meanwhile, for the past days, workforce from the LGU and volunteers has been busy in the delivery of in-kind donations to the doorsteps of fire victims. Most of the victims sought temporary shelter in the houses of their immediate families and relatives. Mayor Jerome Tudlong, Jr., extended his gratitude to everyone for their unselfish acts in helping the fire victims. He added cash and in-kind donations, and manpower and equipment services at the incident site are a big help to those who lost their homes, properties, and livelihood. The mayor assured all donations would go to the victims. “I am deeply touched by the enormous support and generosity that we continue to receive. We thank all those who helped us, be it in monetary, materials, services, prayers, mental and physical support, regardless of where, how, and when they did it. What is important is that you helped us,” the mayor said. – Alpine K. Malwagay  ', '  BENITA PALDAYA BALACOA December 26, 1936 – April 7, 2023 _______________ JOSEPHINE “Bagayo” BAYAO BALDO January 29, 1969 – April 12, 2023 _______________ VIRGINIA MENDOZA BALEGAN-BASIL March 5, 1942 – April 20, 2023 _______________ JOAQUIN STA. MARIA BOGAYONG _______________ ALEJANDRINA AGCON GOMEZ March 10, 1936 – April 3, 2023 _______________ LUZ LAIGO LIBATIQUE April 14, 1925 – April 24, 2023 _______________ CYNTHIA BASIYO TADE July 18, 1962 – April 16, 2023 _______________ RODRIGO “Rudy” L. VENTURA October 21, 1949 – April 6, 2023  ']
}